test/fixtures/shopify_order_with_refund.json

{
    "id": 300277858331,
    "email": "ed@sweetist.com",
    "closed_at": null,
    "created_at": "2018-01-20T14:37:23-05:00",
    "updated_at": "2018-01-20T14:43:10-05:00",
    "number": 129,
    "note": null,
    "token": "635a2071f58b4fc19df984ed8f59b5c6",
    "gateway": "manual",
    "test": false,
    "total_price": "3701.75",
    "subtotal_price": "3400.00",
    "total_weight": 0,
    "total_tax": "301.75",
    "taxes_included": false,
    "currency": "USD",
    "financial_status": "partially_refunded",
    "confirmed": true,
    "total_discounts": "0.00",
    "total_line_items_price": "3400.00",
    "cart_token": null,
    "buyer_accepts_marketing": false,
    "name": "#1129",
    "referring_site": null,
    "landing_site": null,
    "cancelled_at": null,
    "cancel_reason": null,
    "total_price_usd": "3701.75",
    "checkout_token": null,
    "reference": null,
    "user_id": 3454828571,
    "location_id": null,
    "source_identifier": null,
    "source_url": null,
    "processed_at": "2018-01-20T14:37:23-05:00",
    "device_id": null,
    "phone": null,
    "customer_locale": null,
    "app_id": 1354745,
    "browser_ip": null,
    "landing_site_ref": null,
    "order_number": 1129,
    "discount_codes": [],
    "note_attributes": [],
    "payment_gateway_names": [
        "manual"
    ],
    "processing_method": "manual",
    "checkout_id": null,
    "source_name": "shopify_draft_order",
    "fulfillment_status": null,
    "tax_lines": [
        {
            "title": "NY State Tax",
            "price": "136.00",
            "rate": 0.04
        },
        {
            "title": "New York County Tax",
            "price": "165.75",
            "rate": 0.04875
        }
    ],
    "tags": "",
    "contact_email": "ed@sweetist.com",
    "order_status_url": "https://checkout.shopify.com/24470507/orders/635a2071f58b4fc19df984ed8f59b5c6/authenticate?key=3b6e5d19ec157a7e7a246d1304481bf5",
    "line_items": [
        {
            "id": 578523758619,
            "variant_id": 4139316019227,
            "title": "Test Tsheet product",
            "quantity": 31,
            "price": "100.00",
            "sku": "Sku - e",
            "variant_title": "52",
            "vendor": "sweet_shopify",
            "fulfillment_service": "manual",
            "product_id": 303547613211,
            "requires_shipping": true,
            "taxable": true,
            "gift_card": false,
            "name": "Test Tsheet product - 52",
            "variant_inventory_management": null,
            "properties": [],
            "product_exists": true,
            "fulfillable_quantity": 31,
            "grams": 0,
            "total_discount": "0.00",
            "fulfillment_status": null,
            "tax_lines": [
                {
                    "title": "NY State Tax",
                    "price": "124.00",
                    "rate": 0.04
                },
                {
                    "title": "New York County Tax",
                    "price": "151.12",
                    "rate": 0.04875
                }
            ]
        },
        {
            "id": 578523791387,
            "variant_id": 5221638340635,
            "title": "Test product from Shopify",
            "quantity": 30,
            "price": "10.00",
            "sku": "sku-tt",
            "variant_title": null,
            "vendor": "sweet_shopify",
            "fulfillment_service": "manual",
            "product_id": 303074639899,
            "requires_shipping": true,
            "taxable": true,
            "gift_card": false,
            "name": "Test product from Shopify",
            "variant_inventory_management": null,
            "properties": [],
            "product_exists": true,
            "fulfillable_quantity": 25,
            "grams": 0,
            "total_discount": "0.00",
            "fulfillment_status": null,
            "tax_lines": [
                {
                    "title": "NY State Tax",
                    "price": "12.00",
                    "rate": 0.04
                },
                {
                    "title": "New York County Tax",
                    "price": "14.63",
                    "rate": 0.04875
                }
            ]
        }
    ],
    "shipping_lines": [],
    "billing_address": {
        "first_name": "Ed",
        "address1": "555 1000th St, New York, NY",
        "phone": null,
        "city": "New York",
        "zip": "10001",
        "province": "New York",
        "country": "United States",
        "last_name": "Chang",
        "address2": "AA",
        "company": null,
        "latitude": 40.75368539999999,
        "longitude": -73.9991637,
        "name": "Ed Chang",
        "country_code": "US",
        "province_code": "NY"
    },
    "shipping_address": {
        "first_name": "Ed",
        "address1": "555 1000th St, New York, NY",
        "phone": null,
        "city": "New York",
        "zip": "10001",
        "province": "New York",
        "country": "United States",
        "last_name": "Chang",
        "address2": "AA",
        "company": null,
        "latitude": 40.75368539999999,
        "longitude": -73.9991637,
        "name": "Ed Chang",
        "country_code": "US",
        "province_code": "NY"
    },
    "fulfillments": [],
    "refunds": [
        {
            "id": 12783321115,
            "order_id": 300277858331,
            "created_at": "2018-01-20T14:43:10-05:00",
            "note": "",
            "restock": null,
            "user_id": 3454828571,
            "processed_at": "2018-01-20T14:43:10-05:00",
            "refund_line_items": [
                {
                    "id": 16006184987,
                    "quantity": 5,
                    "line_item_id": 578523791387,
                    "subtotal": 50,
                    "total_tax": 4.44,
                    "line_item": {
                        "id": 578523791387,
                        "variant_id": 5221638340635,
                        "title": "Test product from Shopify",
                        "quantity": 30,
                        "price": "10.00",
                        "sku": "sku-tt",
                        "variant_title": null,
                        "vendor": "sweet_shopify",
                        "fulfillment_service": "manual",
                        "product_id": 303074639899,
                        "requires_shipping": true,
                        "taxable": true,
                        "gift_card": false,
                        "name": "Test product from Shopify",
                        "variant_inventory_management": null,
                        "properties": [],
                        "product_exists": true,
                        "fulfillable_quantity": 25,
                        "grams": 0,
                        "total_discount": "0.00",
                        "fulfillment_status": null,
                        "tax_lines": [
                            {
                                "title": "NY State Tax",
                                "price": "12.00",
                                "rate": 0.04
                            },
                            {
                                "title": "New York County Tax",
                                "price": "14.63",
                                "rate": 0.04875
                            }
                        ]
                    }
                }
            ],
            "transactions": [
                {
                    "id": 351560007707,
                    "order_id": 300277858331,
                    "amount": "54.44",
                    "kind": "refund",
                    "gateway": "manual",
                    "status": "success",
                    "message": "Refunded 54.44 from manual gateway",
                    "created_at": "2018-01-20T14:43:10-05:00",
                    "test": false,
                    "authorization": null,
                    "currency": "USD",
                    "location_id": null,
                    "user_id": null,
                    "parent_id": 351549849627,
                    "device_id": null,
                    "receipt": {},
                    "error_code": null,
                    "source_name": "web"
                }
            ],
            "order_adjustments": []
        }
    ],
    "customer": {
        "id": 286556160027,
        "email": "ed@sweetist.com",
        "accepts_marketing": false,
        "created_at": "2017-12-05T10:08:33-05:00",
        "updated_at": "2018-01-20T14:43:11-05:00",
        "first_name": "Ed",
        "last_name": "Chang",
        "orders_count": 88,
        "state": "disabled",
        "total_spent": "135316.51",
        "last_order_id": 300277858331,
        "note": null,
        "verified_email": true,
        "multipass_identifier": null,
        "tax_exempt": false,
        "phone": null,
        "tags": "",
        "last_order_name": "#1129",
        "default_address": {
            "id": 308432830491,
            "customer_id": 286556160027,
            "first_name": "Ed",
            "last_name": "Chang",
            "company": null,
            "address1": "555 1000th St, New York, NY",
            "address2": "AA",
            "city": "New York",
            "province": "New York",
            "country": "United States",
            "zip": "10001",
            "phone": null,
            "name": "Ed Chang",
            "province_code": "NY",
            "country_code": "US",
            "country_name": "United States",
            "default": true
        }
    }
}
